// pages/list/list.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    list: [
      { id: 1, title: '麻辣小龙虾', introduce: '经典口味虾麻辣小龙虾做法.................................................................', source: '下厨房', dateTime: '2018-03-15', author: 'XXX'},
      { id: 2, title: '麻辣小龙虾', introduce: '经典口味虾麻辣小龙虾做法.................................................................', source: '下厨房', dateTime: '2018-03-15', author: 'XXX' },
      { id: 3, title: '麻辣小龙虾', introduce: '经典口味虾麻辣小龙虾做法.................................................................', source: '下厨房', dateTime: '2018-03-15', author: 'XXX' },
      { id: 4, title: '麻辣小龙虾', introduce: '经典口味虾麻辣小龙虾做法.................................................................', source: '下厨房', dateTime: '2018-03-15', author: 'XXX' },
      { id: 5, title: '麻辣小龙虾', introduce: '经典口味虾麻辣小龙虾做法.................................................................', source: '下厨房', dateTime: '2018-03-15', author: 'XXX' },
      { id: 6, title: '麻辣小龙虾', introduce: '经典口味虾麻辣小龙虾做法.................................................................', source: '下厨房', dateTime: '2018-03-15', author: 'XXX' },
      { id: 7, title: '麻辣小龙虾', introduce: '经典口味虾麻辣小龙虾做法.................................................................', source: '下厨房', dateTime: '2018-03-15', author: 'XXX' },
      { id: 8, title: '麻辣小龙虾', introduce: '经典口味虾麻辣小龙虾做法.................................................................', source: '下厨房', dateTime: '2018-03-15', author: 'XXX' },
      { id: 9, title: '麻辣小龙虾', introduce: '经典口味虾麻辣小龙虾做法.................................................................', source: '下厨房', dateTime: '2018-03-15', author: 'XXX' },
      { id: 10, title: '麻辣小龙虾', introduce: '经典口味虾麻辣小龙虾做法.................................................................', source: '下厨房', dateTime: '2018-03-15', author: 'XXX' },
      { id: 11, title: '麻辣小龙虾', introduce: '经典口味虾麻辣小龙虾做法.................................................................', source: '下厨房', dateTime: '2018-03-15', author: 'XXX' },
      { id: 12, title: '麻辣小龙虾', introduce: '经典口味虾麻辣小龙虾做法.................................................................', source: '下厨房', dateTime: '2018-03-15', author: 'XXX' },
      { id: 13, title: '麻辣小龙虾', introduce: '经典口味虾麻辣小龙虾做法.................................................................', source: '下厨房', dateTime: '2018-03-15', author: 'XXX' }
    ]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
  
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {
  
  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {
  
  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {
  
  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {
  
  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {
  
  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {
  
  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {
  
  }
})